app/views/shelterpets/index.html.erb

SELECT "pets".* FROM "pets" WHERE "pets"."shelter_id" = $1  [["shelter_id", 916]]
---
  <section class="pets-sec">
    <% @shelter.pets.each do |pet| %>