app/controllers/favorites_controller.rb

SELECT "pets".* FROM "pets" WHERE "pets"."id" = $1  [["id", 460]]
---
  def index
    if session[:favorites]
      @favs = Pet.find(session[:favorites].keys)