app/controllers/pets_controller.rb

  def update
    @pet = Pet.find(params[:id])
    # params.delete_if { |param, value| value.blank? }
    if @pet.update(pet_params)
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 674], ["LIMIT", 1]]
UPDATE "pets" SET "name" = $1, "description" = $2, "approximate_age" = $3, "sex" = $4, "updated_at" = $5 WHERE "pets"."id" = $6  [["name", "Kat"], ["description", "Too Hot for TV"], ["approximate_age", 4], ["sex", "female"], ["updated_at", "2020-02-03 19:00:11.580004"], ["id", 684]]

  def destroy
    if !pending?(Pet.find(params[:id]))
      Pet.destroy(params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 670], ["LIMIT", 1]]
DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 670]]