app/controllers/reviews_controller.rb

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
---
  def new
    @shelter = Shelter.find(params[:shelter_id])

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]
INSERT INTO "reviews" ("title", "rating", "content", "shelter_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "New Review 1"], ["rating", 5], ["content", "Lovely Pet Shelter"], ["shelter_id", 39]]
---
  def create
    @shelter = Shelter.find(params[:shelter_id])

    params.delete :image if ( (params[:image].blank? || has_asset?(params[:image])) )
    review = Review.new(review_params)
    if review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @review = Review.find(params[:review_id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "title" = $1, "rating" = $2, "content" = $3 WHERE "reviews"."id" = $4  [["title", "Edits"], ["rating", 1], ["content", "Bad Shelter"], ["id", 1]]
---
  def update
    @review = Review.find(params[:review_id])

    params.delete :image if ( (params[:image].blank? || has_asset?(params[:image])) )

    if @review.update(review_params)

DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 6]]
---
  def destroy
    Review.destroy(params[:review_id])