app/controllers/shelterpets_controller.rb

  def index
    @shelter  = Shelter.find(params[:shelter_id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 916], ["LIMIT", 1]]

  def new
    @shelter = Shelter.find(params[:shelter_id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 916], ["LIMIT", 1]]

  def create
    @shelter = Shelter.find(params[:shelter_id])
    pet = @shelter.pets.new(pet_params)
    if pet.save
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 916], ["LIMIT", 1]]
INSERT INTO "pets" ("name", "approximate_age", "sex", "shelter_id", "created_at", "updated_at", "description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"