app/controllers/shelters_controller.rb

  def index
    @shelters = Shelter.all
---
SELECT "shelters".* FROM "shelters"

  def show
    @shelter = Shelter.find(params[:id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 899], ["LIMIT", 1]]

  def create
    shelter = Shelter.create(shelter_params)
---
INSERT INTO "shelters" ("name", "address", "city", "state", "zip") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Marc's Shelter"], ["address", "222 Victory Rd."], ["city", "Okinawa"], ["state", "TX"], ["zip", "75231"]]

  def edit
    @shelter = Shelter.find(params[:id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 906], ["LIMIT", 1]]

  def update
    @shelter = Shelter.find(params[:id])
    if @shelter.update(shelter_params)
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 906], ["LIMIT", 1]]
UPDATE "shelters" SET "address" = $1, "city" = $2, "state" = $3, "zip" = $4 WHERE "shelters"."id" = $5  [["address", "321 2nd St."], ["city", "Denver"], ["state", "CO"], ["zip", "80020"], ["id", 906]]

  def destroy
    shelter = Shelter.find(params[:id])
    if shelter.pets.any? {|pet| pet.adoptable == "Pending" }
      flash[:notice] = "Can't Delete Shelter with Pending Pet Applications"
      redirect_to "/shelters/#{params[:id]}"
    else
      shelter.pets.destroy_all
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 904], ["LIMIT", 1]]
DELETE FROM "shelters" WHERE "shelters"."id" = $1  [["id", 904]]